Emacs.org
#+title: Emacs Configuration

* Inspirations of this Emacs configuration

The organization of this emacs configuration was inspired by [[https://protesilaos.com/emacs/dotemacs][prot's dotemacs configuration]].

* Getting Started

This org file is used to set up my emacs configuration. The code blocks of this org file
will be executed using =org-babel-tangle=. Thus, to initiate you must use =M-x ^org-babel-tangle= or use the key-binding =C-c C-v t=.

* Dependencies

** Fonts

This emacs configuration, if running the GUI version requires the font type called [[https://github.com/protesilaos/iosevka-comfy][iosevka-comfy]]. I have a copy of the git repo attached as a submodule in the fonts directory of this repository. Make sure that have that font style installed.

* Running Emacs
** In the Command Line 

To run emacs in the command-line/terminal simply use the following command while in your command-line/terminal: =emacs -nw=.

* The early initialization of Emacs (=early-init.el=) 
** The =early-init.el= macro to run code only in a Desktop Environment

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes

  (defvar jw-emacs-tiling-window-manager-regexp "bspwm\\|herbstluftwm\\|i3"
    "Regular expression to  tiling window managers.
  See definition of `prot-emacs-with-desktop-session'.")

  (defmacro jw-emacs-with-desktop-session (&rest body)
    "Expand BODY if desktop session is not a tiling window manager.
  See `prot-emacs-tiling-window-manager-regexp' for what
  constitutes a matching tiling window manager."
    (declare (indent 0))
    `(when-let ((session (getenv "DESKTOP_SESSION"))
                ((not (string-match-p session jw-emacs-tiling-window-manager-regexp))))
       ,@body))

#+end_src

** The =early-init.el= code to set frame parameters

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes

;; Set frame parameters early
(setq initial-frame-alist
      (append '((alpha . (90 . 90))
                (fullscreen . maximized))
              initial-frame-alist))

(setq default-frame-alist
      (append '((alpha . (90 . 90))
                (fullscreen . maximized))
              default-frame-alist))

;; Ensure the current frame is also updated
(add-hook 'window-setup-hook
          (lambda ()
            (set-frame-parameter nil 'alpha '(90 . 90))
            (set-frame-parameter nil 'fullscreen 'maximized)))

#+end_src

** The =early-init.el= basic frame settings

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes

  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '("%b")
        ring-bell-function 'ignore
        use-dialog-box t ; only for mouse events, which I seldom use
        use-file-dialog nil
        use-short-answers t
        inhibit-splash-screen t
        inhibit-startup-screen t
        inhibit-x-resources t
        inhibit-startup-echo-area-message user-login-name ; read the docstring
        inhibit-startup-buffer-menu t)

  ;; I do not use those graphical elements by default, but I do enable
  ;; them from time-to-time for testing purposes or to demonstrate
  ;; something.  NEVER tell a beginner to disable any of these.  They
  ;; are helpful.
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)

#+end_src
** The =early-init.el= hook to improve Startup Performance

Make startup faster by reducing the frequency of garbage collection and then use a hook to measure Emacs startup time.

Also, turn on =lexical-binding= for the init file!

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes

  ;; -*- lexical-binding: t; -*-

  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  ;; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))

#+end_src

** The =early-init.el= defines general theme related functions

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes
  (defun jw-emacs-theme-gsettings-dark-p ()
    "Return non-nil if gsettings (GNOME) has a dark theme.
  Return nil if the DESKTOP_SESSION is either bspwm or
  herbstluftwm, per the configuration of my dotfiles.  Also check
  the `delight' shell script."
    (jw-emacs-with-desktop-session
      (string-match-p
       "dark"
       (shell-command-to-string "gsettings get org.gnome.desktop.interface color-scheme"))))

  (defun jw-emacs-theme-twm-dark-p ()
    "Return non-nil if my custom setup has a dark theme.
  I place a file in ~/.config/prot-xtwm-active-theme which contains
  a single word describing my system-wide theme.  This is part of
  my dotfiles.  Check my `delight' shell script for more."
    (when-let ((file "~/.config/jw-xtwm-active-theme")
               ((file-exists-p file)))
        (string-match-p
         "dark"
         (with-temp-buffer
           (insert-file-contents file)
           (buffer-string)))))

  (defun jw-emacs-theme-environment-dark-p ()
    "Return non-nil if environment theme is dark."
    (or (jw-emacs-theme-twm-dark-p)
        (jw-emacs-theme-gsettings-dark-p)))

  (defun jw-emacs-re-enable-frame-theme (_frame)
    "Re-enable active theme, if any, upon FRAME creation.
  Add this to `after-make-frame-functions' so that new frames do
  not retain the generic background set by the function
  `prot-emacs-avoid-initial-flash-of-light'."
    (when-let ((theme (car custom-enabled-themes)))
      (enable-theme theme)))

#+end_src
** The =early-init.el= gives a name to the default frame

The following configuration is taken from [[https://protesilaos.com/emacs/dotemacs#h:ad227f7e-b0a7-43f8-91d6-b50db82da9ad][prot's configuration]].

Finally, I like to call my default frame =home=. This is because I use my =beframe= package to group the list of buffers on a per-frame basis ([[https://protesilaos.com/emacs/dotemacs#h:77e4f174-0c86-460d-8a54-47545f922ae9][The prot-emacs-window.el section about beframe]]). The multi-frame arrangement is the best thing I ever did to boost my productivity: bonus points when used in tandem with a tiling window manager.

Naming frames allows you to select them using completion. Emacs can do this (=M-x select-frame-by-name=), though it is not always reliable as it depends on the window manager (it works fine on GNOME, from what I can tell). For minimalist window managers on Linux, something like the =rofi= program can select system windows based on their name.

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes

  (add-hook 'after-init-hook (lambda () (set-frame-name "home")))

#+end_src

** The =early-init.el= section to add modules and libraries to the Emacs configuration

#+begin_src emacs-lisp :tangle ".emacs.d/early-init.el" :mkdirp yes

  (add-to-list 'load-path (expand-file-name "jw-emacs-modules" user-emacs-directory))
  (add-to-list 'load-path (expand-file-name "jw-lisp" user-emacs-directory))

#+end_src
* The main initialization of Emacs (=init.el=)
** The =init.el= conditional to remove display of mode-line

Want to disable to mode-line at the very start and enable it when the mode-line configuration is loaded to make startup look smooth. The mode-line will be added when the mode-line is loaded ([[*The =jw-emacs-modeline.el= to enable the mode-line][The =jw-emacs-modeline.el= to enable the mode-line]]).

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

(setq-default mode-line-format nil)

#+end_src
** The =init.el= setting to =dired= --native

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  (require 'dired)

  (add-hook 'dired-mode-hook
            (lambda ()
              (define-key dired-mode-map (kbd "(") 'dired-hide-details-mode)
              ;; Uncomment the next line to start with details hidden
              (dired-hide-details-mode 1)
              ))


#+end_src
** The =init.el= settings for packages (=use-package=) --native

[[https://github.com/jwiegley/use-package][use-package]] is a native package built into emacs since =v29.0.0= and is used in this configuration to make it a lot easier to automate the installation and configuration of everything else.

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  ;; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("melpa-stable" . "https://stable.melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (add-to-list 'package-archives
               '("gnu-devel" . "https://elpa.gnu.org/devel/") :append)

  (package-initialize)
  (unless package-archive-contents
   (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
     (package-install 'use-package))

  (setq use-package-always-ensure t)

#+end_src

To debug =use-package= run =emacs --debug-init=.

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  (if init-file-debug
      (setq use-package-verbose t
            use-package-expand-minimally nil
            use-package-compute-statistics t
            debug-on-error t)
    (setq use-package-verbose nil
          use-package-expand-minimally t))
#+end_src

To remove packages that are not used run =M-x use-package-autoremove=. However, the current code only works for packages that have the =:ensure= | =:vc= | =:init= keywords. 

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  (eval-and-compile
    (defvar use-package-selected-packages nil
     "Explicitly installed packages.")

    (define-advice use-package-handler/:ensure
        (:around (fn name-symbol keyword args rest state) select)
      (let ((items (funcall fn name-symbol keyword args rest state)))
        (dolist (ensure args items)
          (let ((package
                 (or (and (eq ensure t) (use-package-as-symbol name-symbol))
                     ensure)))
            (when package
              (when (consp package)
                (setq package (car package)))
              (push `(add-to-list 'use-package-selected-packages ',package) items))))))

    (define-advice use-package-handler/:vc
        (:around (fn name-symbol &rest rest) select)
      (cons `(add-to-list 'use-package-selected-packages ',name-symbol)
            (apply fn name-symbol rest))))

  (define-advice use-package-handler/:init
    (:around (fn name-symbol keyword args rest state) select)
  (let ((items (funcall fn name-symbol keyword args rest state)))
    (dolist (init args items)
      (push `(add-to-list 'use-package-selected-packages ',name-symbol) items))))

  (defun use-package-autoremove ()
  "Autoremove packages not used by use-package."
  (interactive)
  (let ((package-selected-packages use-package-selected-packages))
    (package-autoremove)))

#+end_src

If you get a package not found error and the package exists, then you can try
refreshing the package contents by running =M-x package-refresh-contents=.

** The =init.el= for easy leader key management (=general.el=)

[[https://github.com/noctuid/general.el][general.el]] is a fantastic library for defining prefixed keybindings, especially
in conjunction with Evil modes.

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  (use-package general
    :ensure t
    :config
    (general-create-definer jw/leader-key-def
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC"))

#+end_src

** The =init.el= essential key configurations
*** The =init.el= essential key configuration for =esc=

Bind the quit prompting function to the =esc= key.

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src

*** The =init.el= essential key configuration for indentation

Use spaces instead of tabs for indentation

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  (setq-default indent-tabs-mode nil)

#+end_src

*** The =init.el= essential key configuration for user interface toggles

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  (jw/leader-key-def
    "t"  '(:ignore t :which-key "toggles")
    "tw" 'whitespace-mode
    )

#+end_src
