Emacs.org
*** The =init.el= essential key configuration for =evil-mode=

This configuration uses [[https://evil.readthedocs.io/en/latest/index.html][evil-mode]] for a Vi-like modal editing experience.  [[https://github.com/emacs-evil/evil-collection][evil-collection]] is used to automatically configure various Emacs modes with Vi-like keybindings for evil-mode.

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes
  (use-package evil
    :ensure t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :ensure t
    :config
    (evil-collection-init))

#+end_src

** The =init.el= setting to always start with the *scratch* buffer

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  ;; Always start with *scratch*
  (setq initial-buffer-choice t)

#+end_src
** The =init.el= for additional configurations for =emacs=

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  ;; A few more useful configurations...
  (use-package emacs
    :ensure t
    :init
    ;; TAB cycle if there are only few candidates
    ;; (setq completion-cycle-threshold 3)

    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    ;; (setq tab-always-indent 'complete)

    ;; Emacs 30 and newer: Disable Ispell completion function. As an alternative,
    ;; try `cape-dict'.
    (setq text-mode-ispell-word-completion nil)

    ;; Emacs 28 and newer: Hide commands in M-x which do not apply to the current
    ;; mode.  Corfu commands are hidden, since they are not used via M-x. This
    ;; setting is useful beyond Corfu.
    (setq read-extended-command-predicate #'command-completion-default-include-p))

#+end_src

** The =init.el= user options

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  ;; taken from prot's config
  ;; For those who use my dotfiles and need an easy way to write their
  ;; own extras on top of what I already load: search below for the files
  ;; prot-emacs-pre-custom.el and prot-emacs-post-custom.el
  (defgroup jw-emacs nil
    "User options for my dotemacs.
  These produce the expected results only when set in a file called
  prot-emacs-pre-custom.el.  This file must be in the same
  directory as the init.el."
    :group 'file)

#+end_src
** The =init.el= user option to enable which-key

The =which-key= package provides hints for keys that complete the currently incomplete sequence. Here we determine whether to load the module or not. I personally never rely on =which-key= even if I enable its mode. If I ever need to review which key bindings are available I will either type =C-h= to complete a key sequence (produces a Help buffer with relevant keys) or I will do =C-h m= (=M-x describe-mode= to get information about the current major mode).

Remember to read how these options come into effect ([[https://protesilaos.com/emacs/dotemacs#h:5a41861f-4c38-45ac-8da2-51d77c0b4a73][The init.el user options]]).

Also check the [[https://protesilaos.com/emacs/dotemacs#h:ddb1070d-2f91-4224-ad43-ef03f038f787][prot-emacs-which-key.el module]].

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  (defcustom jw-emacs-load-which-key nil
    "When non-nil, display key binding hints after a short delay.
  This user option must be set in the `prot-emacs-pre-custom.el'
  file.  If that file exists in the Emacs directory, it is loaded
  before all other modules of my setup."
    :group 'jw-emacs
    :type 'boolean)

#+end_src

** The =init.el= user option to load a theme family

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes


  (defcustom jw-emacs-load-theme-family 'modus
    "Set of themes to load.
  Valid values are the symbols `ef', `modus', and `standard', which
  reference the `ef-themes', `modus-themes', and `standard-themes',
  respectively.

  A nil value does not load any of the above (use Emacs without a
  theme).

  This user option must be set in the `jw-emacs-pre-custom.el'
  file.  If that file exists in the Emacs directory, it is loaded
  before all other modules of my setup."
    :group 'jw-emacs
    :type '(choice :tag "Set of themes to load" :value modus
                   (const :tag "The `ef-themes' module" ef)
                   (const :tag "The `modus-themes' module" modus)
                   (const :tag "The `standard-themes' module" standard)
                   (const :tag "Do not load a theme module" nil)))

#+end_src
** The =init.el= final part to load the individual modules

Load the =jw-emacs-modules=.

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes
  (load (locate-user-emacs-file "jw-emacs-pre-custom.el") :no-error :no-message)
  (require 'jw-emacs-theme)
  (require 'jw-emacs-essentials)
  (require 'jw-emacs-modeline)
  (require 'jw-emacs-completion)
  (require 'jw-emacs-org)
  (require 'jw-emacs-git)
  (require 'jw-emacs-dired)
  (require 'jw-emacs-information-management)
  (require 'jw-emacs-development)
  (require 'jw-emacs-langs)

#+end_src

Load =jw-lisp=.

#+begin_src emacs-lisp :tangle ".emacs.d/init.el" :mkdirp yes

  (require 'jw-copy)

#+end_src
* The modules of my Emacs configuration (=jw-emacs-modules/=)
** The =jw-emacs-theme.el= module
*** The =jw-emacs-theme.el= section to load a theme (=jw-emacs-load-theme-family=)

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-theme.el" :mkdirp yes

  ;;; Theme setup and related

  ;;;; Load the desired theme module
  ;; These all reference my packages: `modus-themes', `ef-themes',
  ;; `standard-themes'.
  (when jw-emacs-load-theme-family
    (require
     (pcase jw-emacs-load-theme-family
       ('ef 'jw-emacs-ef-themes)
       ('modus 'jw-emacs-modus-themes)
       ('standard 'jw-emacs-standard-themes))))

#+end_src

**** The =jw-emacs-modus-themes.el= module -- native

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-modus-themes.el" :mkdirp yes

  ;;; The Modus themes

  ;; The themes are highly customisable.  Read the manual:
  ;; <https://protesilaos.com/emacs/modus-themes>.
  (use-package modus-themes
    :ensure t
    :demand t
    :bind (("<f5>" . modus-themes-toggle)
           ("C-<f5>" . modus-themes-select))
    :config
    (setq modus-themes-custom-auto-reload nil
          modus-themes-to-toggle '(modus-operandi modus-vivendi)
          ;; modus-themes-to-toggle '(modus-operandi-tinted modus-vivendi-tinted)
          ;; modus-themes-to-toggle '(modus-operandi-deuteranopia modus-vivendi-deuteranopia)
          ;; modus-themes-to-toggle '(modus-operandi-tritanopia modus-vivendi-tritanopia)
          modus-themes-mixed-fonts t
          modus-themes-variable-pitch-ui t
          modus-themes-italic-constructs t
          modus-themes-bold-constructs nil
          modus-themes-completions '((t . (extrabold)))
          modus-themes-prompts '(extrabold)
          modus-themes-headings
          '((agenda-structure . (variable-pitch light 2.2))
            (agenda-date . (variable-pitch regular 1.3))
            (t . (regular 1.15))))

    (setq modus-themes-common-palette-overrides nil))
    (if (jw-emacs-theme-environment-dark-p)
      (modus-themes-load-theme (cadr modus-themes-to-toggle))
      (modus-themes-load-theme (car modus-themes-to-toggle)))
   (provide 'jw-emacs-modus-themes)

#+end_src

**** The =jw-emacs-ef-themes.el= module

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-ef-themes.el" :mkdirp yes

  ;;; The Ef (εὖ) themes

  ;; The themes are customisable.  Read the manual:
  ;; <https://protesilaos.com/emacs/ef-themes>.
  (use-package ef-themes
    :ensure t
    :demand t
    :bind ("<f5>" . ef-themes-select)
    :config
    (setq ef-themes-variable-pitch-ui t
          ef-themes-mixed-fonts t
          ef-themes-headings ; read the manual's entry of the doc string
          '((0 . (variable-pitch light 1.9))
            (1 . (variable-pitch light 1.8))
            (2 . (variable-pitch regular 1.7))
            (3 . (variable-pitch regular 1.6))
            (4 . (variable-pitch regular 1.5))
            (5 . (variable-pitch 1.4)) ; absence of weight means `bold'
            (6 . (variable-pitch 1.3))
            (7 . (variable-pitch 1.2))
            (agenda-date . (semilight 1.5))
            (agenda-structure . (variable-pitch light 1.9))
            (t . (variable-pitch 1.1))))

    ;; The `ef-themes' provide lots of themes.  I want to pick one at
    ;; random when I start Emacs: the `ef-themes-load-random' does just
    ;; that (it can be called interactively as well).  I just check with
    ;; my desktop environment to determine if the choice should be about
    ;; a light or a dark theme.  Those functions are in my init.el.
    (if (jw-emacs-theme-environment-dark-p)
        (ef-themes-load-random 'dark)
      (ef-themes-load-random 'light)))
(provide 'jw-emacs-ef-themes)
#+end_src
*** The =jw-emacs-theme.el= section for =pulsar=

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-theme.el" :mkdirp yes

  ;;;; Pulsar
  ;; Read the pulsar manual: <https://protesilaos.com/emacs/pulsar>.
  (use-package pulsar
    :ensure t
    :config
    (setopt pulsar-pulse t
            pulsar-delay 0.055
            pulsar-iterations 10
            pulsar-face 'pulsar-magenta
            pulsar-highlight-face 'pulsar-cyan)

    (pulsar-global-mode 1)
    :hook
    ;; There are convenience functions/commands which pulse the line using
    ;; a specific colour: `pulsar-pulse-line-red' is one of them.
    ((next-error . (pulsar-pulse-line-red pulsar-recenter-top pulsar-reveal-entry))
     (minibuffer-setup . pulsar-pulse-line-red))
    :bind
    ;; pulsar does not define any key bindings.  This is just my personal
    ;; preference.  Remember to read the manual on the matter.  Evaluate:
    ;;
    ;; (info "(elisp) Key Binding Conventions")
    (("C-x l" . pulsar-pulse-line) ; override `count-lines-page'
     ("C-x L" . pulsar-highlight-dwim))) ; or use `pulsar-highlight-line'
#+end_src

*** The =jw-emacs-theme.el= section for =lin=

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-theme.el" :mkdirp yes

  ;;;; Lin
  ;; Read the lin manual: <https://protesilaos.com/emacs/lin>.
  (use-package lin
    :ensure t
    :hook (after-init . lin-global-mode) ; applies to all `lin-mode-hooks'
    :config
    ;; You can use this to live update the face:
    ;;
    ;; (customize-set-variable 'lin-face 'lin-green)
    ;;
    ;; Or `setopt' on Emacs 29: (setopt lin-face 'lin-yellow)
    ;;
    ;; I still prefer `setq' for consistency.
    (setq lin-face 'lin-magenta))

#+end_src
*** The =jw-emacs-theme.el= section for =spacious-padding=

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-theme.el" :mkdirp yes

  ;;;; Increase padding of windows/frames
  ;; Yet another one of my packages:
  ;; <https://protesilaos.com/codelog/2023-06-03-emacs-spacious-padding/>.
  (use-package spacious-padding
    :ensure t
    :if (display-graphic-p)
    :hook (after-init . spacious-padding-mode)
    :bind ("<f8>" . spacious-padding-mode)
    :init
    ;; These are the defaults, but I keep it here for visiibility.
    (setq spacious-padding-widths
          '( :internal-border-width 15
             :header-line-width 4
             :mode-line-width 6
             :tab-width 4
             :right-divider-width 1
             :scroll-bar-width 8
             :left-fringe-width 20
             :right-fringe-width 20))

    ;; Read the doc string of `spacious-padding-subtle-mode-line' as
    ;; it is very flexible.
    (setq spacious-padding-subtle-mode-line
          `( :mode-line-active ,(if (or (eq jw-emacs-load-theme-family 'modus)
                                        (eq jw-emacs-load-theme-family 'standard))
                                    'default
                                  'help-key-binding)
             :mode-line-inactive window-divider)))

#+end_src
