Emacs.org
*** The =jw-emacs-org.el= section for text display (=visual-fill-column.el=)

=visual-fill-column= will create a document looking display with the extra padding on the left and on the right.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-org.el" :mkdirp yes

  (defun jw/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . jw/org-mode-visual-fill))

#+end_src
*** The =jw-emacs-org.el= section for org-latex

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-org.el" :mkdirp yes

(with-eval-after-load 'ox-latex
  (add-to-list 'org-latex-classes
               '("org-plain-latex"
                 "\\documentclass{article}
             [NO-DEFAULT-PACKAGES]
             [PACKAGES]
             [EXTRA]"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

  (add-to-list 'org-latex-classes
               '("org-plain-no-section-numbering-latex"
                 "\\documentclass{article}
             [NO-DEFAULT-PACKAGES]
             [PACKAGES]
             [EXTRA]"
                 ("\\section*{%s}" . "\\section*{%s}")
                 ("\\subsection*{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection*{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph*{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph*{%s}" . "\\subparagraph*{%s}"))))

#+end_src

*** The =jw-emacs-org.el= call to provide

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-org.el" :mkdirp yes

  (provide 'jw-emacs-org)

#+end_src

** The =jw-emacs-git.el= module
*** The =jw-emacs-git.el= section for =magit.el=

[[https://magit.vc/][Magit]] is the best Git interface I've ever used.  Common Git operations are easy to execute quickly using Magit's command panel system.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-git.el" :mkdirp yes

  (require 'package)
  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/") t)

  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  ;; NOTE: Make sure to configure a GitHub token before using this package!
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
  (use-package forge)

#+end_src


Sign git commits with ssh rather than gpg. Not the optimal solution, but the solution was found to work on this  issue on magit github repo: [[https://github.com/magit/magit/discussions/5046][magit ssh signing discussion]]

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-git.el" :mkdirp yes

  (defun magit-read-gpg-signing-key (prompt &optional initial-input history)
    "")

#+end_src

*** The =jw-emacs-git.el= call to provide

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-git.el" :mkdirp yes

  (provide 'jw-emacs-git)

#+end_src

** The =jw-emacs-dired.el= module
*** The =jw-emacs-dired.el= section for dired display

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-dired.el" :mkdirp yes

  (setq dired-listing-switches "-alD")

#+end_src

*** The =jw-emacs-dired.el= section for gnu =gls=

For macos, make sure to have =coreutils= installed. To install run, =brew install coreutils=

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-dired.el" :mkdirp yes

  (setq insert-directory-program "gls" 
       dired-use-ls-dired t)

#+end_src

*** The =jw-emacs-dired.el= call to provide

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-dired.el" :mkdirp yes

  (provide 'jw-emacs-dired)

#+end_src

** The =jw-emacs-information-management.el= module
*** The =jw-emacs-information-management.el= section for =denote=

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-information-management.el" :mkdirp yes

  (use-package denote
                   :ensure t)

  (setq denote-directory (expand-file-name "~/Otzar/Gnosis/"))
  (setq denote-save-buffer-after-creation nil)

#+end_src


Enable the denote dired mode for all files so that the components can easily be seen.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-information-management.el" :mkdirp yes

  (add-hook 'dired-mode-hook #'denote-dired-mode)

#+end_src

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-information-management.el" :mkdirp yes

  (setq denote-known-keywords '("theology" "philosophy" "politics" "journal" "analysis" "linguistics"))
  (setq denote-infer-keywords t)
  (setq denote-sort-keywords t)

#+end_src

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-information-management.el" :mkdirp yes

  (setq denote-file-type nil) ; Org is the default, set others here
  (setq denote-prompts '(subdirectory title keywords))
  (setq denote-excluded-directories-regexp nil)
  (setq denote-excluded-keywords-regexp nil)
  (setq denote-rename-no-confirm nil) ; Set to t if you are familiar with `denote-rename-file'

  ;; Pick dates, where relevant, with Org's advanced interface:
  (setq denote-date-prompt-use-org-read-date t)
  ;; Read this manual for how to specify `denote-templates'.  We do not
  ;; include an example here to avoid potential confusion.
  (setq denote-date-format nil) ; read doc string

  ;; By default, we do not show the context of links.  We just display
  ;; file names.  This provides a more informative view.
  (setq denote-backlinks-show-context t)

  ;; Also see `denote-link-backlinks-display-buffer-action' which is a bit
  ;; advanced.

  ;; If you use Markdown or plain text files (Org renders links as buttons
  ;; right away)
  (add-hook 'find-file-hook #'denote-link-buttonize-buffer)

  (with-eval-after-load 'org-capture
  (setq denote-org-capture-specifiers "%l\n%i\n%?")
  (add-to-list 'org-capture-templates
               '("n" "New note (with denote.el)" plain
                 (file denote-last-path)
                 #'denote-org-capture
                 :no-save t
                 :immediate-finish nil
                 :kill-buffer t
                 :jump-to-captured t)))

  ;; Also check the commands `denote-link-after-creating',
  ;; `denote-link-or-create'.  You may want to bind them to keys as well.


  ;; If you want to have Denote commands available via a right click
  ;; context menu, use the following and then enable
  ;; `context-menu-mode'.
  (add-hook 'context-menu-functions #'denote-context-menu)

#+end_src

*** The =jw-emacs-information-management.el= section for =ledger-mode=

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-information-management.el" :mkdirp yes

  (use-package ledger-mode
    :ensure t
    :mode (
           "\\.ledger\\'")
    :custom (ledger-clear-whole-transactions t))


#+end_src

*** The =jw-emacs-information-management.el= section for clean directories

Move the =#<FILE>#= to a temporary directory instead of root directory.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-information-management.el" :mkdirp yes

  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))

  (setq lock-file-name-transforms
      '(("\\`/.*/\\([^/]+\\)\\'" "/var/tmp/\\1" t)))

#+end_src

*** The =jw-emacs-information-management.el= call to provide

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-information-management.el" :mkdirp yes

  (provide 'jw-emacs-information-management)

#+end_src

** The =jw-emacs-development.el= module
*** The =jw-emacs-development.el= section for =project.el=  --native

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (require 'project)

#+end_src


Set the project paths, but currently the code below only works for =emacs 30+=.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes
   (defun jw/project-prompter ()
        (read-file-name "Select a project folder:"
                        "~/Projects/Code/"
                        nil
                        nil
                        nil
                        #'file-directory-p))
   (setq project-prompter #'jw/project-prompter)

#+end_src

*** The =jw-emacs-development.el= section for visualizing parent delimiters --native

=show-paren-mode= allows one to see matching pairs of parentheses and other characters. When point is on the opening character of one of the paired characters, the other is highlighted. When the point is after the closing character of one of the paired characters, the other is highlighted. 

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (show-paren-mode 1)

#+end_src

*** The =jw-emacs-development.el= section for visualizing all delimiters 

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth.  This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

*** The =jw-emacs-development.el= section for pairing delimiters (=electric-pair-mode=) --native

=electric-pair-mode= will auto pair delimiters for you. One issue with the auto pairing is the =<= character in =org-mode=. The following hook to the enabling of =electric-pair-mode= aims to solve the issue when in =org-mode=.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (electric-pair-mode t)

  (add-hook 'org-mode-hook (lambda ()
           (setq-local electric-pair-inhibit-predicate
                   `(lambda (c)
                  (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))

#+end_src

*** The =jw-emacs-development.el= section for pairing delimiters (=evil-surround=)

=evil-surround= emulates [[https://github.com/tpope/vim-surround][surround.vim]]. For usage instructions visit [[https://github.com/emacs-evil/evil-surround][evil-surround]]

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (use-package evil-surround
    :ensure t
    :config
    (global-evil-surround-mode 1))

#+end_src

*** The =jw-emacs-development.el= section for logging keys (=command-log-mode=)

[[https://github.com/lewang/command-log-mode][command-log-mode]] is useful for displaying a panel showing each key binding you use in a panel on the right side of the frame. Great for live streams and screencasts!


#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (use-package command-log-mode)

#+end_src

To activate =command-log-mode= you must first run =M-x global-command-log-mode= to have =command-log-mode= in every buffer and then run =M-x clm/toggle-command-log-buffer= to have the buffer be displayed.
*** The =jw-emacs-development.el= call to provide

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-development.el" :mkdirp yes

  (provide 'jw-emacs-development)

#+end_src

** The =jw-emacs-which-key.el= module

There is a user option in my setup to load this module ([[https://protesilaos.com/emacs/dotemacs#h:24324854-1f8c-4d8b-aa7c-291de968cbf4][The init.el option to enable which-key]]).

When the =which-key-mode= is enabled, any incomplete key sequence will produce a popup at the lower part of the Emacs frame showing keys that complete the current sequence together with the name of the command they are invoking.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-which-key.el" :mkdirp yes

  (use-package which-key
    :ensure t
    :hook (after-init . which-key-mode)
    :config
    (setq which-key-separator "  ")
    (setq which-key-prefix-prefix "... ")
    (setq which-key-max-display-columns 3)
    (setq which-key-idle-delay 1.5)
    (setq which-key-idle-secondary-delay 0.25)
    (setq which-key-add-column-padding 1)
    (setq which-key-max-description-length 40))

  (provide 'jw-emacs-which-key)

#+end_src
** The =jw-emacs-langs.el= module

*** The =jw-emacs-langs.el= section for language server configuration (=eglot=) --native

Undo the Eglot modifications of =completion-category-defaults=.
#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  (with-eval-after-load 'eglot
     (setq completion-category-defaults nil))

#+end_src

*** The =jw-emacs-langs.el= section for =python= support

Configuring pythone envs with =conda=.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

    (unless (package-installed-p 'conda)
      (package-refresh-contents)
      (package-install 'conda))

    (require 'conda)
    (setq conda-anaconda-home (expand-file-name "~/miniconda3"))
    (setq conda-env-home-directory (expand-file-name "~/miniconda3"))
      (conda-env-autoactivate-mode t)


#+end_src

Define =jw/find-python-langserver=

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  (defun jw/find-pyright-langserver ()
    (or (executable-find "pyright-langserver")
        (expand-file-name "~/miniconda3/bin/pyright-langserver")))

#+end_src

Python formatter configuration.

#+begin_src emacs-lisp :tangle ".emacs.d/jw-emacs-modules/jw-emacs-langs.el" :mkdirp yes

  (use-package python-black
    :demand t
    :after python
    :hook (python-mode . python-black-on-save-mode-enable-dwim))

#+end_src


